; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 865176 2 2 2 4 5
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	infrared1 - mode
	infrared0 - mode
	Star0 - direction
	Star3 - direction
	GroundStation2 - direction
	Star1 - direction
	Phenomenon4 - direction
	Planet5 - direction
	Star6 - direction
	Phenomenon7 - direction
	Star8 - direction
)
(:init
	(supports instrument0 infrared1)
	(supports instrument0 infrared0)
	(calibration_target instrument0 GroundStation2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet5)
	(supports instrument1 infrared1)
	(supports instrument1 infrared0)
	(calibration_target instrument1 Star1)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon4)
)
(:goal (and
	(pointing satellite0 Star3)
	(have_image Phenomenon4 infrared1)
	(have_image Planet5 infrared0)
	(have_image Star6 infrared1)
	(have_image Phenomenon7 infrared1)
	(have_image Star8 infrared0)
))

)

; plan
1. (turn_to satellite0 star3 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 star3)
   goals met: 1 of 6
2. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 1 of 6
3. (turn_to satellite1 star1 phenomenon4)
   deleted: (pointing satellite1 phenomenon4)
   added: (pointing satellite1 star1)
   goals met: 1 of 6
4. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 6
5. (calibrate satellite1 instrument1 star1)
   added: (calibrated instrument1)
   goals met: 1 of 6
6. (turn_to satellite0 star6 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 star6)
   goals met: 0 of 6
7. (turn_to satellite1 star8 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 star8)
   goals met: 0 of 6
8. (turn_to satellite0 star3 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 star3)
   goals met: 1 of 6
9. (take_image satellite1 star8 instrument1 infrared0)
   added: (have_image star8 infrared0)
   goals met: 2 of 6
10. (turn_to satellite0 phenomenon7 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 phenomenon7)
   goals met: 1 of 6
11. (turn_to satellite1 star6 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 star6)
   goals met: 1 of 6
12. (turn_to satellite0 star3 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 star3)
   goals met: 2 of 6
13. (take_image satellite1 star6 instrument1 infrared1)
   added: (have_image star6 infrared1)
   goals met: 3 of 6
14. (turn_to satellite0 phenomenon7 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 phenomenon7)
   goals met: 2 of 6
15. (turn_to satellite1 planet5 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 planet5)
   goals met: 2 of 6
16. (turn_to satellite0 star3 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 star3)
   goals met: 3 of 6
17. (take_image satellite1 planet5 instrument1 infrared0)
   added: (have_image planet5 infrared0)
   goals met: 4 of 6
18. (turn_to satellite0 phenomenon4 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 phenomenon4)
   goals met: 3 of 6
19. (turn_to satellite1 phenomenon7 planet5)
   deleted: (pointing satellite1 planet5)
   added: (pointing satellite1 phenomenon7)
   goals met: 3 of 6
20. (turn_to satellite0 star3 phenomenon4)
   deleted: (pointing satellite0 phenomenon4)
   added: (pointing satellite0 star3)
   goals met: 4 of 6
21. (take_image satellite1 phenomenon7 instrument1 infrared1)
   added: (have_image phenomenon7 infrared1)
   goals met: 5 of 6
22. (turn_to satellite1 phenomenon4 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 phenomenon4)
   goals met: 5 of 6
23. (take_image satellite1 phenomenon4 instrument1 infrared1)
   added: (have_image phenomenon4 infrared1)
   goals met: 6 of 6
